In [4]:
#importing libraries
import pandas as pd
import numpy as np
import sys

In [5]:
#check version
print("python versions",sys.version)
print("pandas  versions",pd.__version__)#double underscore is required

python versions 3.7.1 (default, Dec 10 2018, 22:54:23) [MSC v.1915 64 bit (AMD64)]
pandas  versions 0.23.4

In [6]:
#creating a series
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={"a":10,"b":20,"c":30}

In [7]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
ser1=pd.Series([1,2,3,4],index=['usa','germany','ussr','japan'])

In [18]:
ser1

usa        1
germany    2
ussr       3
japan      4
dtype: int64

In [25]:
ser2=pd.Series([1,2,5,4],index=['usa','germany','ninjago','japan'])

In [26]:
ser2

usa        1
germany    2
ninjago    5
japan      4
dtype: int64

In [27]:
ser1+ser2 # nan : not a number

germany    4.0
japan      8.0
ninjago    NaN
usa        2.0
ussr       NaN
dtype: float64

In [ ]:
# split
#a.split
# output:["d","e","zyre"]

In [10]:
from numpy.random import randn

np.random.seed(301)# seed generator

In [11]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [33]:
df

          W         X         Y         Z
A -0.252629 -0.593808  0.110763 -0.238531
B -0.065020 -0.572748  1.487732 -2.655067
C  0.290297  0.600534  0.094342  1.395041
D -2.027578  0.397984 -0.207987 -1.512460
E  0.175543  0.679116  0.293605  0.398612

In [55]:
df=pd.DataFrame(randn(5,4),index=['A ','B' ,'C ','D ','E'],columns=['W','X','Y','Z'])

In [57]:
df.drop('A ')

           W         X         Y         Z
B   0.381838  0.301519  0.925303  0.323600
C  -1.563455  0.536316 -0.162192 -1.644191
D  -1.013527 -0.905168  0.515547 -2.126074
E  -0.222478  0.503274 -0.179360 -1.228616

In [38]:
df

           W         X         Y         Z
A  -0.011769 -1.213315  1.633464  0.073614
B   0.045671  0.667868  2.668295  0.689577
C   0.364418 -1.822616 -1.262166  0.458175
D  -1.254919  0.468414 -0.758119 -0.097254
E  -2.155586 -0.225904  0.294274 -0.134986

In [39]:
# fetch coloumns
df[['W','X']]# type of coloumn of dataframe is series

           W         X
A  -0.011769 -1.213315
B   0.045671  0.667868
C   0.364418 -1.822616
D  -1.254919  0.468414
E  -2.155586 -0.225904

In [40]:
type(df['W'])#type checking

pandas.core.series.Series

In [41]:
df['new']=df['W']+df['Y']
# adding a row is not easy

In [42]:
df

           W         X         Y         Z       new
A  -0.011769 -1.213315  1.633464  0.073614  1.621695
B   0.045671  0.667868  2.668295  0.689577  2.713966
C   0.364418 -1.822616 -1.262166  0.458175 -0.897748
D  -1.254919  0.468414 -0.758119 -0.097254 -2.013038
E  -2.155586 -0.225904  0.294274 -0.134986 -1.861312

In [43]:
#removing a col temporary 
df.drop('new',axis=1)

           W         X         Y         Z
A  -0.011769 -1.213315  1.633464  0.073614
B   0.045671  0.667868  2.668295  0.689577
C   0.364418 -1.822616 -1.262166  0.458175
D  -1.254919  0.468414 -0.758119 -0.097254
E  -2.155586 -0.225904  0.294274 -0.134986

In [44]:
df

           W         X         Y         Z       new
A  -0.011769 -1.213315  1.633464  0.073614  1.621695
B   0.045671  0.667868  2.668295  0.689577  2.713966
C   0.364418 -1.822616 -1.262166  0.458175 -0.897748
D  -1.254919  0.468414 -0.758119 -0.097254 -2.013038
E  -2.155586 -0.225904  0.294274 -0.134986 -1.861312

In [45]:
#  for permanent deletion
df.drop("new",axis=1,inplace=True)

In [50]:
df

           W         X         Y         Z
A  -0.011769 -1.213315  1.633464  0.073614
B   0.045671  0.667868  2.668295  0.689577
C   0.364418 -1.822616 -1.262166  0.458175
D  -1.254919  0.468414 -0.758119 -0.097254
E  -2.155586 -0.225904  0.294274 -0.134986

In [54]:
#for droping a row
df.drop('A')

KeyError: "['A'] not found in axis"

In [48]:
df

           W         X         Y         Z
A  -0.011769 -1.213315  1.633464  0.073614
B   0.045671  0.667868  2.668295  0.689577
C   0.364418 -1.822616 -1.262166  0.458175
D  -1.254919  0.468414 -0.758119 -0.097254
E  -2.155586 -0.225904  0.294274 -0.134986

In [58]:
df1 = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
      columns=['max_speed', 'shield'])

In [59]:
df1

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [67]:
#.loc labels are used to access the rows
#.iloc integer valuues are used

df1.loc['cobra':'viper','max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [ ]:
df1.loc['cobra':'viper','max_speed']

In [68]:
#row label is required in iloc goes according to iloc
df1.iloc[2]

max_speed    7
shield       8
Name: sidewinder, dtype: int64

In [70]:
mydict=[{'a':1,'b':2,'c':3},
         {'a':100,'b':200,'c':300,'d':400},
         {'a':1000,'b':2000,'c':3000,'d':4000}]

In [73]:
df2 = pd.DataFrame(mydict)
df2

      a     b     c       d
0     1     2     3     NaN
1   100   200   300   400.0
2  1000  2000  3000  4000.0

In [74]:
df2.iloc[2]

a    1000.0
b    2000.0
c    3000.0
d    4000.0
Name: 2, dtype: float64

In [78]:
df2.iloc[1:2,0:3]# slicing by iloc

     a    b    c
1  100  200  300

In [79]:
# dealing with missing data Nan no
# check the value is null or not
#dropna()
#isnull.sum : col ke coressponding sum return karta hai
#fillna to fill  null values

df=pd.DataFrame({'A':[1,2,np.nan],
                'B':[5,np.nan,np.nan],
               'C':[1,2,3] })

In [80]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [81]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [82]:
df.isnull().sum()# gives the data of null values

A    1
B    2
C    0
dtype: int64

In [83]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [84]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [86]:
df.fillna(value='fill Value')

            A           B  C
0           1           5  1
1           2  fill Value  2
2  fill Value  fill Value  3

In [89]:
# fill value of mean in data set
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [90]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [91]:
# fill value of median in data set
df['A'].fillna(value=df['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [93]:
#groupby
data={'Company':['Goog','Goog','msft','msft','fb','fb'],
     'Person':['sam','charlie','amy','vanessa','carl','sarah'],
     'sales':[200,1320,340,124,243,350]}

In [94]:
df=pd.DataFrame(data)

In [95]:
df

  Company   Person  sales
0    Goog      sam    200
1    Goog  charlie   1320
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [96]:
df.head() # gives top five rows

  Company   Person  sales
0    Goog      sam    200
1    Goog  charlie   1320
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243

In [97]:
df.tail(3)

  Company   Person  sales
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Company    6 non-null object
Person     6 non-null object
sales      6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [99]:
df.describe()

             sales
count     6.000000
mean    429.500000
std     444.545498
min     124.000000
25%     210.750000
50%     291.500000
75%     347.500000
max    1320.000000

In [100]:
df.describe(include="all")

       Company   Person        sales
count        6        6     6.000000
unique       3        6          NaN
top       Goog  vanessa          NaN
freq         2        1          NaN
mean       NaN      NaN   429.500000
std        NaN      NaN   444.545498
min        NaN      NaN   124.000000
25%        NaN      NaN   210.750000
50%        NaN      NaN   291.500000
75%        NaN      NaN   347.500000
max        NaN      NaN  1320.000000

In [101]:
by_comp=df.groupby("Company")

In [102]:
by_comp

In [105]:
by_comp.mean()

         sales
Company
Goog     760.0
fb       296.5
msft     232.0

In [106]:
by_comp.std()

              sales
Company
Goog     791.959595
fb        75.660426
msft     152.735065

In [114]:
by_comp.Company.max()# in argument mention coloumn

Company
Goog    Goog
fb        fb
msft    msft
Name: Company, dtype: object

In [111]:
by_comp.Company.max()

Company
Goog    Goog
fb        fb
msft    msft
Name: Company, dtype: object

In [115]:
#the initial set of baby names and birth rates
names=['bob','jessica','mary', 'john','mel']
births=[968,155,77,578,973]

In [116]:
# to merge these lists we use zip function
zip?

In [117]:
Babydataset=list(zip(names,births))
Babydataset

[('bob', 968), ('jessica', 155), ('mary', 77), ('john', 578), ('mel', 973)]

In [118]:
df=pd.DataFrame(data=Babydataset,columns=['name','births'])

In [119]:
df

      name  births
0      bob     968
1  jessica     155
2     mary      77
3     john     578
4      mel     973

In [121]:
#csv comma seperated values
df.to_csv('births1980.csv',index=False)# index here used  to prevent multiple indexing

In [124]:
df=pd.read_csv(r'C:\Users\APOORV\births1980.csv')#reading the file

In [123]:
df

      name  births
0      bob     968
1  jessica     155
2     mary      77
3     john     578
4      mel     973